In [13]:
import pandas

df = pandas.read_csv('C:\Local\python-training\Day-3\question2_data.csv')

#1.1 remove special chars from column name
df.columns = df.columns.str.replace('#', '')
df.columns = df.columns.str.replace('@', '')
df

       Name          Salary
0    Am$$it    20,00,000.00
1     Sumit    40,00,000.00
2      John             NaN
3       NaN    80,00,000.00
4  Lok&&esh  1,00,00,000.00
5     Kiran  1,20,00,000.00
6      Amar    60,00,000.00

In [15]:
#1.2 remove special chars from data where it is there
df.Name = df.Name.str.replace('$', '')
df.Name = df.Name.str.replace('&', '')
df

     Name          Salary
0    Amit    20,00,000.00
1   Sumit    40,00,000.00
2    John             NaN
3     NaN    80,00,000.00
4  Lokesh  1,00,00,000.00
5   Kiran  1,20,00,000.00
6    Amar    60,00,000.00

In [18]:
#1.3  remove all the rows having Null values	
df.dropna(subset=['Name', 'Salary'], inplace=True)
df

     Name          Salary
0    Amit    20,00,000.00
1   Sumit    40,00,000.00
4  Lokesh  1,00,00,000.00
5   Kiran  1,20,00,000.00
6    Amar    60,00,000.00

In [49]:
#2. find the net salary after 30% deduction of tax
df.dtypes
#df.Salary = df.Salary.str.replace(',', '')
df['Salary'] = df['Salary'].astype(float)
df['Salary_after_tax'] = df.Salary*0.7
df

     Name      Salary  Salary_after_tax   Int_sal
0    Amit   2000000.0         1400000.0   2000000
1   Sumit   4000000.0         2800000.0   4000000
4  Lokesh  10000000.0         7000000.0  10000000
5   Kiran  12000000.0         8400000.0  12000000
6    Amar   6000000.0         4200000.0   6000000

In [34]:
#3. Filter the salaries of people where name starts with S	

df[(df.Name.str.startswith('S'))][['Name', 'Salary']]

    Name     Salary
1  Sumit  4000000.0

In [37]:
#4. create another column Int_Sal where salary is stored as integer type

df['Int_sal'] = df.Salary
df['Int_sal'] = df['Int_sal'].astype(int)
df

     Name      Salary  Salary_after_tax   Int_sal
0    Amit   2000000.0         1400000.0   2000000
1   Sumit   4000000.0         2800000.0   4000000
4  Lokesh  10000000.0         7000000.0  10000000
5   Kiran  12000000.0         8400000.0  12000000
6    Amar   6000000.0         4200000.0   6000000

In [39]:
#5. Find the name of employee having maximum salary

df[(df.Int_sal == df.Int_sal.max())]['Name']

5    Kiran
Name: Name, dtype: object

In [40]:
#6. Filter the salaries of employees having n in the last

df[(df.Name.str.endswith('n'))][['Name', 'Salary']]

    Name      Salary
5  Kiran  12000000.0

In [43]:
#7. Sort the data based on Name	

df.sort_values(by='Name', ascending=True).head()

     Name      Salary  Salary_after_tax   Int_sal
6    Amar   6000000.0         4200000.0   6000000
0    Amit   2000000.0         1400000.0   2000000
5   Kiran  12000000.0         8400000.0  12000000
4  Lokesh  10000000.0         7000000.0  10000000
1   Sumit   4000000.0         2800000.0   4000000

In [48]:
#8. filter the names of employees where salary is between 400000 and 600000
df[(df.Int_sal > 400000) & (df.Int_sal < 600000)]['Name'].head()

Series([], Name: Name, dtype: object)

In [50]:
#9. Find the Mean salary from the salary column
df.Salary.mean()

6800000.0

: